W8/W8D1/RedditClone/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "ibrahim"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    @user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "i70etjIhiwTN0SMGQyth0g"], ["updated_at", "2021-05-03 21:28:25.417648"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!