reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Ok8Iax3CpHeqGEXDacC4Qw=="], ["updated_at", "2021-03-08 19:24:57.465380"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.base64
    self.save!