W8/W8D1/RedditClone/app/controllers/subs_controller.rb

  def show
    @sub = Sub.find_by(id: params[:id])
    @moderator = User.find_by(id: @sub.moderator_id)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = params[:user_id]
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cats"], ["description", "cats galore"], ["moderator_id", 1], ["created_at", "2021-05-03 22:15:12.745683"], ["updated_at", "2021-05-03 22:15:12.745683"]]