W8/W8D1/RedditClone/app/views/subs/show.html.erb

<h1><%= @sub.title %></h1>
<%if !@sub.posts.empty?%>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]

          <tr>
            <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]