W7/music_app/app/models/user.rb

  def generate_session_token
    token = SecureRandom.urlsafe_base64(16)
    while self.class.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Fyo3XKk1FvFKNoMLi_mMTg"], ["LIMIT", 1]]